<a href="https://colab.research.google.com/github/Chekuru-Ravi/hello-world/blob/master/6_Merge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy  as np
import pandas as pd

In [ ]:
data1 = {
    'id': [1, 2],
    'name': ['maruthi', 'sahana']
}
df1 = pd.DataFrame(data1)

In [ ]:
data2 = {
    'id': [1, 3],
    'dept': ['analytics', 'tech']
}
df2 = pd.DataFrame(data2)

In [ ]:
df1

   id     name
0   1  maruthi
1   2   sahana

In [ ]:
df2

   id       dept
0   1  analytics
1   3       tech

In [ ]:
pd.merge(df1,df2,on='id',how='inner')

   id     name       dept
0   1  maruthi  analytics

In [ ]:
pd.merge(df1,df2,on='id',how='left')

   id     name       dept
0   1  maruthi  analytics
1   2   sahana        NaN

In [ ]:
pd.merge(df1,df2,on='id',how='right')

   id     name       dept
0   1  maruthi  analytics
1   3      NaN       tech

In [ ]:
pd.merge(df1,df2,on='id',how='outer')

   id     name       dept
0   1  maruthi  analytics
1   2   sahana        NaN
2   3      NaN       tech

In [ ]:
data1 = {
    'id1': [1, 2],
    'name': ['maruthi', 'sahana']
}
df1 = pd.DataFrame(data1)

In [ ]:
data2 = {
    'id2': [1, 3],
    'dept': ['analytics', 'tech']
}
df2 = pd.DataFrame(data2)

In [ ]:
df1

   id1     name
0    1  maruthi
1    2   sahana

In [ ]:
df2

   id2       dept
0    1  analytics
1    3       tech

In [ ]:
pd.merge(df1,df2,left_on='id1', right_on = 'id2',how='inner')

   id1     name  id2       dept
0    1  maruthi    1  analytics

In [ ]:
# Merge on index!

In [ ]:
df1=pd.DataFrame(
    {"letter":["a","b","c"],
     "num":range(3)})
df2=pd.DataFrame(
    {"value":[3,5,7]},
    index=["a","b","e"])

In [ ]:
df1

  letter  num
0      a    0
1      b    1
2      c    2

In [ ]:
df2

   value
a      3
b      5
e      7

In [ ]:
# df1 -> letter column
# df2 -> index

In [ ]:
pd.merge(df1,df2,left_on = 'letter', right_index=True, how = 'inner')

  letter  num  value
0      a    0      3
1      b    1      5

In [ ]:
# col-col joins
# col-index joins
# index-index joins

In [ ]:
df1=pd.DataFrame(
    {"value":[1,2,3]},
    index=["a","b","c"])

df2=pd.DataFrame(
    {"value":[3,5,7]},
    index=["a","b","e"])

In [ ]:
df1

   value
a      1
b      2
c      3

In [ ]:
df2

   value
a      3
b      5
e      7

In [ ]:
pd.merge(df1,df2,left_index=True, right_index=True,how='inner')

   value_x  value_y
a        1        3
b        2        5

In [ ]:
# Cross Join : Cartesian Product
# T1 : 3 rows
# T2 : 3 rows
# o/p : 3*3 = 9 rows

In [ ]:
# Available T-shirt sizes
df_sizes = pd.DataFrame({
    'size': ['S', 'M', 'L']
})

# Available T-shirt colors
df_colors = pd.DataFrame({
    'color': ['Red', 'Blue']
})

In [ ]:
df_sizes

  size
0    S
1    M
2    L

In [ ]:
df_colors

  color
0   Red
1  Blue

In [ ]:
df_variants = pd.merge(df_sizes, df_colors, how='cross')
df_variants

  size color
0    S   Red
1    S  Blue
2    M   Red
3    M  Blue
4    L   Red
5    L  Blue

In [ ]:
import pandas as pd

employees = pd.DataFrame({
    "emp_id": [101, 102, 103, 104],
    "name": ["Amit", "Neha", "Ravi", "Sara"],
    "dept_id": [1, 2, 2, 4]
})

departments = pd.DataFrame({
    "dept_id": [1, 2, 3],
    "dept_name": ["HR", "Engineering", "Sales"]
})

In [ ]:
# 1. Write code to perform an INNER JOIN between employees and departments on dept_id.
pd.merge(employees, departments, on="dept_id", how="inner")

   emp_id  name  dept_id    dept_name
0     101  Amit        1           HR
1     102  Neha        2  Engineering
2     103  Ravi        2  Engineering

In [ ]:
# 2. Write code to perform a LEFT JOIN that keeps all employees, even if they donâ€™t belong to a department.
pd.merge(employees, departments, on="dept_id", how="left")

   emp_id  name  dept_id    dept_name
0     101  Amit        1           HR
1     102  Neha        2  Engineering
2     103  Ravi        2  Engineering
3     104  Sara        4          NaN

In [ ]:
# 3. Write code to perform a RIGHT JOIN that keeps all departments, even if no employee belongs to them.
pd.merge(employees, departments, on="dept_id", how="right")

   emp_id  name  dept_id    dept_name
0   101.0  Amit        1           HR
1   102.0  Neha        2  Engineering
2   103.0  Ravi        2  Engineering
3     NaN   NaN        3        Sales

In [ ]:
# 4. Write code to perform an OUTER JOIN that keeps all employees and all departments.
pd.merge(employees, departments, on="dept_id", how="outer")

   emp_id  name  dept_id    dept_name
0   101.0  Amit        1           HR
1   102.0  Neha        2  Engineering
2   103.0  Ravi        2  Engineering
3     NaN   NaN        3        Sales
4   104.0  Sara        4          NaN

In [ ]:
# 5. Write code to identify employees whose department
# information is missing after the join.
joined = pd.merge(employees, departments, on="dept_id", how="left")
joined[joined["dept_name"].isna()]

   emp_id  name  dept_id dept_name
3     104  Sara        4       NaN